In [2]:
import pandas as pd
df = pd.read_csv('Emp_Records2.csv')
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,60.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [4]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [5]:
df['Age in Yrs'].mean()

39.074432989690735

In [9]:
df['Age in Yrs'] = df['Age in Yrs'].fillna(df['Age in Yrs'].mean())
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.360000,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.020000,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.150000,NaN,0.98,50155.0,Michigantown
3,408351,Diane,39.074433,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.310000,NaN,NaN,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.820000,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.610000,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.660000,60.0,28.53,95673.0,Detroit
98,392491,Theresa,29.600000,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.380000,55.0,2.26,93650.0,Alma

In [10]:
df['Weight in Kgs'].mean()

58.16494845360825

In [13]:
df['Weight in Kgs'] = df['Weight in Kgs'].fillna(df['Weight in Kgs'].mean())
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.360000,60.000000,13.68,168251.0,Denver
1,940761,Brenda,47.020000,60.000000,9.01,51063.0,Stonewall
2,428945,Joe,54.150000,58.164948,0.98,50155.0,Michigantown
3,408351,Diane,39.074433,51.000000,NaN,180294.0,Hydetown
4,193819,Benjamin,40.310000,58.164948,NaN,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.820000,89.000000,1.05,129774.0,Biloxi
96,704709,Harold,32.610000,77.000000,5.93,156194.0,Carol Stream
97,461593,Nicole,52.660000,60.000000,28.53,95673.0,Detroit
98,392491,Theresa,29.600000,57.000000,6.99,51015.0,Mc Grath
99,495141,Tammy,38.380000,55.000000,2.26,93650.0,Alma

In [14]:
from scipy import stats
stats.mode(df['Weight in Kgs'])

ModeResult(mode=array([60.]), count=array([11]))

In [21]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [23]:
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [49]:
df = pd.read_csv('test.csv')
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,NaN,NaN,NaN,NaN,NaN,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,68.0,0.98,50155.0,Michigantown
3,408351,Diane,39.67,51.0,18.30,180294.0,Hydetown
4,193819,Benjamin,40.31,58.0,4.01,117642.0,Fremont

In [59]:
df1 = df.dropna(thresh=2)
df1

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,NaN,NaN,NaN,NaN,NaN,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,68.0,0.98,50155.0,Michigantown
3,408351,Diane,39.67,51.0,18.30,180294.0,Hydetown
4,193819,Benjamin,40.31,58.0,4.01,117642.0,Fremont